;  //////////////////////
;  // Assault Infantry //
;  //////////////////////

[LWOTC_APA_Assault X2SoldierClassTemplate]
DisplayName = "突击步兵(APA)"
ClassSummary = "精通近战的步兵，以其坚韧和侵略性而闻名，擅长夺取并守住阵地。<br/><br/><font color='#CA7200'>可以使用霰弹枪或刀剑。</font>"
+AbilityTreeTitles = "风暴突击"
+AbilityTreeTitles = "堡垒"
+AbilityTreeTitles = "先锋"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames = "Blitz"
+RandomNickNames = "Brick"
+RandomNickNames = "Butcher"
+RandomNickNames = "Buzzsaw"
+RandomNickNames = "Cajun"
+RandomNickNames = "Chops"
+RandomNickNames = "Cobra"
+RandomNickNames = "Crash"
+RandomNickNames = "Diamond"
+RandomNickNames = "Enforcer"
+RandomNickNames = "Flash"
+RandomNickNames = "Fury"
+RandomNickNames = "Gator"
+RandomNickNames = "Icepick"
+RandomNickNames = "Jaws"
+RandomNickNames = "Knuckles"
+RandomNickNames = "Monster"
+RandomNickNames = "Mustang"
+RandomNickNames = "Pitbull"
+RandomNickNames = "Predator"
+RandomNickNames = "Razor"
+RandomNickNames = "Roman"
+RandomNickNames = "Samurai"
+RandomNickNames = "Scorpion"
+RandomNickNames = "Shogun"
+RandomNickNames = "Slayer"
+RandomNickNames = "Steel"
+RandomNickNames = "Terminator"
+RandomNickNames = "Thane"
+RandomNickNames = "Trojan"
+RandomNickNames = "Vandal"
+RandomNickNames = "Viking"
+RandomNickNames = "Warden"
+RandomNickNames = "Warlord"
+RandomNickNames = "Wolf"
+RandomNickNames = "Wolverine"
+RandomNicknames_Female = "Athena"
+RandomNicknames_Female = "Iron Maiden"
+RandomNicknames_Female = "Shieldmaiden"
+RandomNicknames_Female = "Valkyrie"
+RandomNicknames_Female = "Godmother"
+RandomNickNames_Male = "Axeman"
+RandomNickNames_Male = "Rocky"
+RandomNickNames_Male = "Stallion"
+RandomNickNames_Male = "Wolfman"

+PhotoboothSoloBLines_Female = "Close quarters, no mercy."
+PhotoboothSoloBLines_Female = "Her blade will bring JUSTICE!"
+PhotoboothSoloBLines_Female = "Close, Personal, and DEADLY!"

+PhotoboothSoloBLines_Male = "Close quarters, no mercy."
+PhotoboothSoloBLines_Male = "His blade will bring JUSTICE!"
+PhotoboothSoloBLines_Male = "Close, Personal, and DEADLY!"

; - Encyclopedia Entry -

[LWOTC_APA_Assault X2EncyclopediaTemplate]
ListTitle = "突击步兵"
DescriptionTitle = "突击步兵"
DescriptionEntry = "精通近战的步兵，以其坚韧和侵略性而闻名，擅长夺取并守住阵地。可以使用霰弹枪或刀剑。"

; - GTS Unlocks -

[LWOTC_APA_AssaultUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "突击步兵(APA)：近战突击训练 I"
Summary = "所有突击步兵的近战优势技能现在将从2级开始，无论军衔如何。"

[LWOTC_APA_AssaultUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "突击步兵(APA)：近战突击训练 II"
Summary = "所有突击步兵的近战优势技能现在将从3级开始，无论军衔如何。<br/><br/><font color='#CA7200'>需要近战突击训练 I</font>"

; - Ability Templates -

[LWOTC_APA_PrepForEntry X2AbilityTemplate]
LocFriendlyName = "准备入场"
LocFlyOverText = "准备入场"
LocHelpText = "在激活此能力后，本回合内投掷或发射的下一颗手雷将不会消耗行动点。另外，获得一个手雷槽位以装备第二颗手雷。已装备的闪光弹获得<font color='#3ABD23'>+<Ability:CONCUSSION_GRENADES_CHARGE_BONUS/></font>使用次数，并且大多数其他类型的手雷现在也会在爆炸时使目标失去方向感。"
LocLongDescription = "在激活此能力后，本回合内投掷或发射的下一颗手雷将不会消耗行动点。另外，获得一个手雷槽位以装备第二颗手雷。已装备的闪光弹获得<font color='#3ABD23'>+<Ability:CONCUSSION_GRENADES_CHARGE_BONUS/></font>使用次数，并且大多数其他类型的手雷现在也会在爆炸时使目标失去方向感。"
LocPromotionPopupText = "在激活此能力后，本回合内投掷或发射的下一颗手雷将不会消耗行动点。<br/><br/><Bullet/> 冷却时间 <font color='#CA7200'><Ability:PREP_FOR_ENTRY_COOLDOWN/></font>-回合."


[LWOTC_APA_BreachingManeuver X2AbilityTemplate]
LocFriendlyName = "突破策略"
LocFlyOverText = "突破策略"
LocHelpText = "在对昏迷、混乱或受伤目标进行回合结束攻击后，退还一个行动点。"
LocLongDescription = "在对昏迷、混乱或受伤目标进行回合结束攻击后，退还一个行动点。
LocPromotionPopupText = "突破策略将在任何形式的攻击中触发，无论命中或未命中，只要目标受到伤害并且该攻击会结束回合。<br/><Bullet/> 敌人应处于混乱、迷惑或恐慌状态才能触发此效果。"

[LWOTC_APA_Breakthrough X2AbilityTemplate]
LocFriendlyName = "突破"
LocFlyOverText = "突破"
LocHelpText = "在结束回合的近战攻击后，退还一个移动行动点。"
LocLongDescription = "在结束回合的近战攻击后，退还一个移动行动点。"
LocPromotionPopupText = "<br/><Bullet/> 突破将在任何近战攻击中触发，无论命中与否，只要这次攻击会结束单位的回合。<br/><Bullet/> 与“突袭策略”不同，这并不需要目标处于受伤状态才能触发效果，以补偿近战的风险。"

[LWOTC_APA_ShockAndMaul X2AbilityTemplate]
LocFriendlyName = "震撼一击"
LocFlyOverText = "震撼一击"
LocHelpText = "造成<font color='#3ABD23'>+<Ability:SHOCK_AND_MAUL_DAMAGE_BONUS/></font>伤害，如果目标也在<Ability:ClassName/>的近战半径内<Ability:CQB_DOMINANCE_RADIUS/>并且处于受损状态，则额外造成<font color='#3ABD23'>+<Ability:SHOCK_AND_MAUL_CONDITIONAL_DAMAGE_BONUS/></font>伤害。"
LocLongDescription = "造成<font color='#3ABD23'>+<Ability:SHOCK_AND_MAUL_DAMAGE_BONUS/></font>伤害，如果目标也在<Ability:ClassName/>的近战半径内<Ability:CQB_DOMINANCE_RADIUS/>并且处于受损状态，则额外造成<font color='#3ABD23'>+<Ability:SHOCK_AND_MAUL_CONDITIONAL_DAMAGE_BONUS/></font>伤害。"
LocPromotionPopupText = "<br/><Bullet/> 伤害加成不适用于间接火力（如手榴弹等）攻击。<br/><Bullet/> 只有当单位既在近战半径内又处于受损状态（如被眩晕、混乱、恐慌等）时，才会应用条件性伤害。"


[LWOTC_APA_Ruthless X2AbilityTemplate]
LocFriendlyName = "无情"
LocFlyOverText = "无情"
LocHelpText = "自身所有近战攻击伤害<font color='#3ABD23'>+<Ability:RUTHLESS_DAMAGE_BONUS/></font>，穿甲<font color='#3ABD23'>+5</font>，并有<font color='#3ABD23'>+<Ability:RUTHLESS_CRIT_CHANCE/>%</font>的机会打出暴击。"
LocLongDescription = "自身所有近战攻击伤害<font color='#3ABD23'>+<Ability:RUTHLESS_DAMAGE_BONUS/></font>，穿甲<font color='#3ABD23'>+5</font>，并有<font color='#3ABD23'>+<Ability:RUTHLESS_CRIT_CHANCE/>%</font>的机会打出暴击。"
LocPromotionPopupText = "<br/><Bullet/> 伤害、穿甲和暴击几率适用于所有敌人，包括机器人。"


[LWOTC_APA_SweepAndClear X2AbilityTemplate]
LocFriendlyName = "势如破竹"
LocFlyOverText = "势如破竹"
LocHelpText = "<Ability:NON_MOVE_ACTION_ACTIVATION_LIMIT/> 每回合，在用结束回合的攻击杀死一个被眩晕、受损或混乱的敌人后，退还一个行动点。"
LocLongDescription = "<Ability:NON_MOVE_ACTION_ACTIVATION_LIMIT/> 每回合，在用结束回合的攻击杀死一个被眩晕、受损或混乱的敌人后，退还一个行动点。"
LocPromotionPopupText = "<br/><Bullet/> “势如破竹”可以与“突破策略”或“突破”的移动行动配合，使<Ability:ClassName/>既能移动又能再次攻击。"


[LWOTC_APA_Relentless X2AbilityTemplate]
LocFriendlyName = "残忍"
LocFlyOverText = "残忍"
LocHelpText = "<Ability:NON_MOVE_ACTION_ACTIVATION_LIMIT/> 每回合，如果用结束回合的近战攻击杀死敌人，则会退还一个行动点。"
LocLongDescription = "<Ability:NON_MOVE_ACTION_ACTIVATION_LIMIT/> 每回合，如果用结束回合的近战攻击杀死敌人，则会退还一个行动点。"
LocPromotionPopupText = "<br/><Bullet/> “残忍”可以与“突破策略”或“突破”的移动行动配合，使<Ability:ClassName/>既能移动又能再次攻击。"

[LWOTC_APA_KnifeFighter X2AbilityTemplate]
LocFriendlyName = "匕首战士 (APA)"
LocFlyOverText = "匕首战士 (APA)"
LocHelpText = "允许<Ability:ClassName/>在4格范围内触发匕首攻击作为非回合结束动作。此外，装备匕首可增加+1移动能力。"
LocLongDescription = "允许<Ability:ClassName/>在4格范围内触发匕首攻击作为非回合结束动作。此外，装备匕首可增加+1移动能力。"
LocPromotionPopupText = "允许<Ability:ClassName/>在4格范围内触发匕首攻击作为非回合结束动作。此外，装备匕首可增加+1移动能力。"


;  /////////////////
;  // Field Medic //
;  /////////////////

; - Class Template -

[LWOTC_APA_Medic X2SoldierClassTemplate]
DisplayName = "战地医疗兵(APA)"
ClassSummary = "作为一种快速且多功能的支援单位，战地医疗兵装备齐全，能提供必要的医疗援助，确保你的小队始终保持战斗力。<br/><br/><font color='#CA7200'>也可以使用突击步枪和电弧发射器或手枪。</font>"
+AbilityTreeTitles = "医疗兵"
+AbilityTreeTitles = "战场医疗"
+AbilityTreeTitles = "第一反应"
+AbilityTreeTitles = "XCOM"

;+RankNames = 
;+ShortNames = 

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames = "Doc"
+RandomNickNames = "EMT"
+RandomNickNames = "AED"
+RandomNickNames = "Hypo"
+RandomNickNames = "Bones"
+RandomNickNames = "Booth"
+RandomNickNames = "Needle"
+RandomNickNames = "Whiskey"
+RandomNickNames = "Crash"
+RandomNickNames = "Trauma"
+RandomNickNames = "Panic"
+RandomNickNames = "Pain"
+RandomNickNames = "Hatchet"
+RandomNickNames = "Clip"
+RandomNickNames = "Staples"
+RandomNickNames = "Shocking"
+RandomNickNames = "Sparky"
+RandomNickNames = "Pepper"
+RandomNickNames = "Stitch"
+RandomNickNames = "Squint"
+RandomNickNames = "Squid"
+RandomNickNames = "Gurney"
+RandomNickNames = "Undertaker"
+RandomNickNames = "Aegis"
+RandomNickNames = "Guardian"
+RandomNickNames = "Ayytopsy"
+RandomNickNames = "Ayyectomy"
+RandomNickNames = "Bag & Tag"
+RandomNickNames = "Black Magic"
+RandomNickNames = "Witch Doctor"
+RandomNickNames = "Shaman"
+RandomNickNames = "Elixir"
+RandomNickNames = "Aloe"
+RandomNickNames_Female = "Witch"
+RandomNicknames_Female = "Airmed"
+RandomNicknames_Female = "Sirona"
+RandomNicknames_Female = "Minerva"
+RandomNicknames_Female = "Valkyrie"
+RandomNicknames_Female = "Eir"
+RandomNicknames_Female = "Terminal"
+RandomNickNames_Male = "Medicine Man"
+RandomNickNames_Male = "Shennong"
+RandomNickNames_Male = "Apollo"
+RandomNickNames_Male = "Vejovis"
+RandomNickNames_Male = "Imhotep"
+RandomNickNames_Male = "Hermes"

;+PhotoboothSoloBLines_Female = "ADVENT's diagnosis? Terminal."
;+PhotoboothSoloBLines_Female = "Not all angels have wings."
;+PhotoboothSoloBLines_Female = "He takes away the pain."
;+PhotoboothSoloBLines_Female = "ADVENT is a cancer - and he's the cure."
;+PhotoboothSoloBLines_Female = "Healing humanity - one alien at a time."
;+PhotoboothSoloBLines_Male = "ADVENT's diagnosis? Terminal."
;+PhotoboothSoloBLines_Male = "Not all angels have wings."
;+PhotoboothSoloBLines_Male = "She takes away the pain."
;+PhotoboothSoloBLines_Male = "ADVENT is a cancer - and she's the cure."
;+PhotoboothSoloBLines_Male = "Healing humanity - one alien at a time."

; - Encyclopedia Entry -

[LWOTC_APA_Medic X2EncyclopediaTemplate]
ListTitle = "战地医疗兵"
DescriptionTitle = "战地医疗兵"
DescriptionEntry = "作为一种快速且多功能的支援单位，战地医疗兵装备齐全，能提供必要的医疗援助，确保你的小队始终保持战斗力。"

; - GTS Unlocks -

[LWOTC_APA_MedicUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "战地医疗兵(APA): 医术训练 I"
Summary = "所有战地医疗兵的医疗专家技能现在将从2级开始，无论他们的军衔如何。"

[LWOTC_APA_MedicUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "战地医疗兵(APA): 医术训练 II"
Summary = "所有战地医疗兵的医疗专家技能现在将从3级开始，无论他们的军衔如何。<br/><br/><font color='#CA7200'>需要 医术训练 I</font>"

; - Ability Templates -
[LWOTC_APA_CovertInfiltration X2AbilityTemplate]
LocFriendlyName = "隐秘渗透"
LocFlyOverText = "隐秘渗透"
LocHelpText = "允许在小队隐蔽被破坏时保持隐身，并提供秘密行动和谍报技术能力。"
LocLongDescription = "允许在小队隐蔽被破坏时保持隐身，并提供秘密行动和谍报技术能力。"
LocPromotionPopupText = "<br/><Bullet/> 即使小队初始状态不是隐蔽，拥有秘密潜入能力的士兵仍然会以隐蔽状态开始任务。"


[LWOTC_APA_ArcThrowerSpecialist X2AbilityTemplate]
LocFriendlyName = "电击专家"
LocFlyOverText = "电击专家"
LocHelpText = "你可以免费使用你的电弧投射器，冷却时间为4个回合。此外，使用电弧投射器不再会结束你的回合。"
LocLongDescription = "你可以免费使用你的电弧投射器，冷却时间为4个回合。此外，使用电弧投射器不再会结束你的回合。"
LocPromotionPopupText = "你可以免费使用你的电弧投射器，冷却时间为4个回合。此外，使用电弧投射器不再会结束你的回合。"

[LWOTC_APA_Smokescreen X2AbilityTemplate]
LocFriendlyName = "烟幕"
LocFlyOverText = "烟幕"
LocHelpText = "授予<font color='#3ABD23'>+<Ability:SMOKESCREEN_FREE_SMOKE_GRENADES/></font>免费烟雾手榴弹和<font color='#3ABD23'>+<Ability:SMOKESCREEN_EQUIPPED_SMOKE_BONUS/></font>额外烟雾弹使用次数。此外，投掷烟雾弹不会结束你的回合。你的烟雾弹也会额外为范围内的友军提供命中和意志加成。"
LocLongDescription = "授予<font color='#3ABD23'>+<Ability:SMOKESCREEN_FREE_SMOKE_GRENADES/></font>免费烟雾手榴弹和<font color='#3ABD23'>+<Ability:SMOKESCREEN_EQUIPPED_SMOKE_BONUS/></font>额外烟雾弹使用次数。此外，投掷烟雾弹不会结束你的回合。你的烟雾弹也会额外为范围内的友军提供命中和意志加成。"
LocPromotionPopupText = "允许士兵在所谓的阿尔法打击元数据中从原本无用的烟雾弹中获得一些价值。"


;  ////////////
;  // Marine //
;  ////////////

; - Class Template -

[LWOTC_APA_Marine X2SoldierClassTemplate]
DisplayName = "陆战队(APA)"
ClassSummary = "XCOM的军事力量骨干，陆战队是擅长使用自动武器和跳跃机动的步兵。<br/><br/><font color='#CA7200'>可以使用突击步枪或自动加农炮以及短管霰弹枪。</font>"
+AbilityTreeTitles = "哨兵"
+AbilityTreeTitles = "步枪手"
+AbilityTreeTitles = "机枪手"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames="Alamo"
+RandomNickNames="Albatross"
+RandomNickNames="Alleycat"
+RandomNickNames="Anvil"
+RandomNickNames="Avalanche"
+RandomNickNames="Badger"
+RandomNickNames="Badlands"
+RandomNickNames="Bang Bang"
+RandomNickNames="Banjo"
+RandomNickNames="Barracuda"
+RandomNickNames="Bearcat"
+RandomNickNames="Broadside"
+RandomNickNames="Brutal"
+RandomNickNames="Chainsaw"
+RandomNickNames="Cactus"
+RandomNickNames="Cobalt"
+RandomNickNames="Commando"
+RandomNickNames="Crossfire"
+RandomNickNames="Cyclone"
+RandomNickNames="Double Down"
+RandomNickNames="Falcon"
+RandomNickNames="Flinch"
+RandomNickNames="Frosty"
+RandomNickNames="Hammerhead"
+RandomNickNames="Harrier"
+RandomNickNames="Husker"
+RandomNickNames="Lineback"
+RandomNickNames="Marathon"
+RandomNickNames="Marshal"
+RandomNickNames="Mustang"
+RandomNickNames="Mutt"
+RandomNickNames="Pathfinder"
+RandomNickNames="Payback"
+RandomNickNames="Relentless"
+RandomNickNames="Spartan"
+RandomNickNames="Stryker"
+RandomNickNames="Tomahawk"
+RandomNickNames="Tracer"
+RandomNickNames="Werewolf"
+RandomNickNames="Wolfhound"
+RandomNickNames="Wolverine"
+RandomNickNames_Female="Athena"
+RandomNickNames_Female="Valkyrie"
+RandomNickNames_Male="Duke"
+RandomNickNames_Male="Rocky"
+RandomNickNames_Male="Shelter"

PhotoboothSoloBLines_Female="Bullets: the more the merrier!"
PhotoboothSoloBLines_Female="Once more into the breach!"
PhotoboothSoloBLines_Female="Hero to the Resistance.  Nightmare to its Enemies."

PhotoboothSoloBLines_Male="Bullets: the more the merrier!"
PhotoboothSoloBLines_Male="Once more into the breach!"
PhotoboothSoloBLines_Male="Hero to the Resistance.  Nightmare to its Enemies."

; - Encyclopedia Entry -

[LWOTC_APA_Marine X2EncyclopediaTemplate]
ListTitle = "陆战队"
DescriptionTitle = "陆战队"
DescriptionEntry = "XCOM的军事力量骨干，陆战队是擅长使用自动武器和跳跃机动的步兵。可以使用突击步枪或自动加农炮以及短管霰弹枪。"

; - GTS Unlocks -

[LWOTC_APA_MarineUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "陆战队(APA): 自动武器训练 I"
Summary = "所有海军陆战队士兵的开火纪律熟练度现在将从2级开始，无论军衔如何。"

[LWOTC_APA_MarineUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "陆战队(APA): 自动武器训练 II"
Summary = "所有海军陆战队士兵的开火纪律熟练度现在将从3级开始，无论军衔如何。<br/><br/><font color='#CA7200'>需要 自动武器训练 I</font>"

; - Ability Templates -

[LWOTC_APA_Emplaced X2AbilityTemplate]
LocFriendlyName = "设防"
LocFlyOverText = "设防"
LocHelpText = "如果在上回合没有移动。获得<font color='#3ABD23'>+<Ability:EMPLACED_AIM_BONUS/></font>命中和暴击率，以及<font color='#3ABD23'>+<Ability:EMPLACED_VISION_BONUS/></font>武器射程，直到你移动为止。"
LocLongDescription = "如果在上回合没有移动。获得<font color='#3ABD23'>+<Ability:EMPLACED_AIM_BONUS/></font>命中和暴击率，以及<font color='#3ABD23'>+<Ability:EMPLACED_VISION_BONUS/></font>武器射程，直到你移动为止。"
LocPromotionPopupText = "如果上一回合没有移动，将自动设防以获得<font color='#3ABD23'>+<Ability:EMPLACED_AIM_BONUS/></font>的命中和暴击率加成，且武器射程<font color='#3ABD23'>+<Ability:EMPLACED_VISION_BONUS/></font>格。移动后失效。当设防时，加农炮/机枪可以从开火纪律的反应射击奖励中受益，不仅仅是压制。"


[LWOTC_APA_NoMansLand X2AbilityTemplate]
LocFriendlyName = "无人区"
LocFlyOverText = "无人区"
LocHelpText = "对进入或穿越你的压制区域的未受压制目标进行反应射击。同时减少1回合的区域压制冷却时间。"
LocLongDescription = "对进入或穿越你的压制区域的未受压制目标进行反应射击。同时减少1回合的区域压制冷却时间。"
LocPromotionPopupText = "对进入或穿越你的压制区域的未受压制目标进行反应射击。同时减少1回合的区域压制冷却时间。"


;  //////////////
;  // Marksman //
;  //////////////

; - Class Template -

[LWOTC_APA_Marksman X2SoldierClassTemplate]
DisplayName = "精准射手(APA)"
ClassSummary = "隐秘且精确，擅长侦查和击杀重点目标。<br/><br/><font color='#CA7200'>可以使用狙击步枪或维克托步枪，以及全息瞄准器或手枪。</font>"
+AbilityTreeTitles = "狙击手"
+AbilityTreeTitles = "观测员"
+AbilityTreeTitles = "侦察"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames = "Apex"
+RandomNickNames = "Ace"
+RandomNickNames = "Aftermath"
+RandomNickNames = "Alpha"
+RandomNickNames = "Bullseye"
+RandomNickNames = "Bolt"
+RandomNickNames = "Big Shot"
+RandomNickNames = "Boss"
+RandomNickNames = "Bullseye"
+RandomNickNames = "Checkmate"
+RandomNickNames = "Chief"
+RandomNickNames = "Colt"
+RandomNickNames = "Deadbolt"
+RandomNickNames = "Deadeye"
+RandomNickNames = "Deadwood"
+RandomNickNames = "Eagle Eye"
+RandomNickNames = "Game Time"
+RandomNickNames = "Ghost"
+RandomNickNames = "Grave Digger"
+RandomNickNames = "Hawkeye"
+RandomNickNames = "Hitman"
+RandomNickNames = "Judge"
+RandomNickNames = "Lights Out"
+RandomNickNames = "Long Shot"
+RandomNickNames = "Needle"
+RandomNickNames = "Huntsman"
+RandomNickNames = "Shadow"
+RandomNickNames = "Showtime"
+RandomNickNames = "Specter"
+RandomNickNames = "Slinger"
+RandomNickNames = "Tombstone"
+RandomNickNames = "Undertaker"
+RandomNicknames_Female = "Black Widow"
+RandomNickNames_Male = "Sandman"
+RandomNickNames_Male = "Zeus"
+RandomNickNames_Male = "Blueblood"

+PhotoboothSoloBLines_Female = "Death From Afar"
+PhotoboothSoloBLines_Female = "Go Ahead and Run. You'll Just Die Tired."
+PhotoboothSoloBLines_Female = "Right Between Their Alien Eyes"
+PhotoboothSoloBLines_Female = "The Only Thing She Feels is Recoil"
+PhotoboothSoloBLines_Female = "One shot, one kill."
+PhotoboothSoloBLines_Female = "Patience is bitter, but its fruit is sweet."
+PhotoboothSoloBLines_Female = "Save bullets.  Use a sniper."

+PhotoboothSoloBLines_Male = "Death From Afar"
+PhotoboothSoloBLines_Male = "Go Ahead and Run. You'll Just Die Tired."
+PhotoboothSoloBLines_Male = "Right Between Their Alien Eyes"
+PhotoboothSoloBLines_Male = "The Only Thing He Feels is Recoil"
+PhotoboothSoloBLines_Male = "One shot, one kill."
+PhotoboothSoloBLines_Male = "Patience is bitter, but its fruit is sweet."
+PhotoboothSoloBLines_Male = "Save bullets.  Use a sniper."

; - Encyclopedia Entry -

[LWOTC_APA_Marksman X2EncyclopediaTemplate]
ListTitle = "精准射手"
DescriptionTitle = "精准射手"
DescriptionEntry = "隐秘且精确，擅长侦查和击杀重点目标。"

; - GTS Unlocks -

[LWOTC_APA_MarksmanUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "精准射手(APA): 远距离狙击训练 I"
Summary = "所有精准射手的精确瞄准技能现在将从2级开始，无论他们的军衔如何。"

[LWOTC_APA_MarksmanUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "精准射手(APA): 远距离狙击训练 II"
Summary = "所有精准射手的精确瞄准技能现在将从3级开始，无论他们的军衔如何。<br/><br/><font color='#CA7200'>需要 远距离狙击训练 I</font>"

; - Ability Templates -

[LWOTC_APA_PrecisionTargeting X2AbilityTemplate]
LocFriendlyName = "精确瞄准"
LocFlyOverText = "精确瞄准"
LocHelpText = "<Ability:ClassName/>的射击精准度随着经验的增长而提高。"
LocLongDescription = "<Ability:ClassName/>的射击精准度随着经验的增长而提高。"
LocPromotionPopupText = "<font color='#CA7200'>一级</font>（在 <Ability:RANKNAME1/> 等级 [1] 获得）<br/>获得“支架”能力，以及以下在支架状态下的加成：<br/><Bullet/> 在支架状态下，由于视线范围导致的精度惩罚降低 <font color='#3ABD23'><Ability:PRECISION_TARGETING_SQUADSIGHT_PENALTY_NEGATED_1/>%</font>。<br/><Bullet/> 在支架状态下， <font color='#3ABD23'>+<Ability:PRECISION_TARGETING_COVER_CRIT_BONUS_1/>%</font> 命中和暴击率。<br/><br/><font color='#CA7200'>二级</font>（在 <Ability:RANKNAME3/> 等级 [3] 获得）<br/><Bullet/> 在支架状态下，由于视线范围导致的精度惩罚降低 <font color='#3ABD23'><Ability:PRECISION_TARGETING_SQUADSIGHT_PENALTY_NEGATED_2/>%</font>。<br/><Bullet/> 在支架状态下， <font color='#3ABD23'>+<Ability:PRECISION_TARGETING_COVER_CRIT_BONUS_2/>%</font> 命中和暴击率。<br/><br/><font color='#CA7200'>三级</font>（在 <Ability:RANKNAME6/等级 [6] 获得）<br/><Bullet/> 在支架状态下，由于视线范围导致的精度惩罚降低 <font color='#3ABD23'><Ability:PRECISION_TARGETING_SQUADSIGHT_PENALTY_NEGATED3/>%</font>。<br/><Bullet/> 在支架状态下， <font color='#3ABD23'>+<Ability:PRECISION_TARGETING_COVER_CRIT_BONUS_3/>%</font> 命中和暴击率。<br/><br/>注意<br/><Bullet/> 命中和暴击加成适用于所有目标。"

[LWOTC_APA_TrainedSniper X2AbilityTemplate]
LocFriendlyName = "狙击训练"
LocFlyOverText = "狙击训练"
LocHelpText="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"
LocLongDescription="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"
LocPromotionPopupText="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"


[WOTC_APA_SixthSense X2AbilityTemplate]
LocFriendlyName = "第六感"
LocFlyOverText = "第六感"
LocHelpText = "获得幽灵行者能力（激活能力可提高潜行隐蔽力），并在<font color='#3ABD23'><Ability:SIXTH_SENSE_TILE_RADIUS/></font>格内揭示任何敌人，无需视线。"
LocLongDescription = "获得幽灵行者能力（激活能力可提高潜行隐蔽力），并在<font color='#3ABD23'><Ability:SIXTH_SENSE_TILE_RADIUS/></font>格内揭示任何敌人，无需视线。"
LocPromotionPopupText = "获得幽灵行者能力（激活能力可提高潜行隐蔽力），并在<font color='#3ABD23'><Ability:SIXTH_SENSE_TILE_RADIUS/></font>格内揭示任何敌人，无需视线。"

[WOTC_APA_Recon X2AbilityTemplate]
LocFriendlyName = "侦察"
LocFlyOverText = "侦察"
LocHelpText = "将敌人探测到你的半径减少<font color='#3ABD23'><Ability:RECON_DETECTION_MODIFIER/>%</font>，并增加视野范围<font color='#3ABD23'>+<Ability:RECON_VISION_RANGE_MODIFIER/></font>格。同时赋予熟练技能，允许精确射手更快地渗透任务。"
LocLongDescription = "将敌人探测到你的半径减少<font color='#3ABD23'><Ability:RECON_DETECTION_MODIFIER/>%</font>，并增加视野范围<font color='#3ABD23'>+<Ability:RECON_VISION_RANGE_MODIFIER/></font>格。同时赋予熟练技能，允许精确射手更快地渗透任务。"
LocPromotionPopupText = "将敌人探测到你的半径减少<font color='#3ABD23'><Ability:RECON_DETECTION_MODIFIER/>%</font>，并增加视野范围<font color='#3ABD23'>+<Ability:RECON_VISION_RANGE_MODIFIER/></font>格。同时赋予熟练技能，允许精确射手更快地渗透任务。"

[LWOTC_APA_VitalPointTargeting X2AbilityTemplate]
LocFriendlyName = "关键点定位"
LocFlyOverText = "关键点定位"
LocHelpText = "被全息标记的敌人将会受到<font color='#3ABD23'>+<Ability:HOLOTARGETER_VITAL_POINT_TARGETING_DAMAGE_BONUS/></font>额外伤害，并且被暴击的概率增加<font color='#3ABD23'>+<Ability:HOLOTARGETER_HDHOLO_CRIT_BONUS%</font>。"
LocLongDescription = "被全息标记的敌人将会受到额外伤害，并且更容易被暴击。随着全息瞄准器等级的提高，加成效果也会增强。"
LocPromotionPopupText = "被全息标记的敌人将会受到额外伤害，并且更容易被暴击。随着全息瞄准器等级的提高，加成效果也会增强。"

[LWOTC_APA_EfficientTargeting X2AbilityTemplate]
LocFriendlyName = "高效定位"
LocFlyOverText = "高效定位"
LocHelpText = "全息标记不再结束回合，持续时间<font color='#3ABD23'>+<Ability:HOLOTARGETER_INDEPENDENT_TARGETING_BONUS_TURNS/></font>回合。"
LocLongDescription = "全息标记不再结束回合，持续时间<font color='#3ABD23'>+<Ability:HOLOTARGETER_INDEPENDENT_TARGETING_BONUS_TURNS/></font>回合。"
LocPromotionPopupText = "全息标记不再结束回合，持续时间<font color='#3ABD23'>+<Ability:HOLOTARGETER_INDEPENDENT_TARGETING_BONUS_TURNS/></font>回合。"

[LWOTC_APA_Phase X2AbilityTemplate]
LocFriendlyName = "相位"
LocFlyOverText = "相位"
LocHelpText = "获得 暗影步 和 转移 能力"
LocLongDescription = "获得 暗影步 和 转移 能力"
LocPromotionPopupText = "获得 暗影步 和 转移 能力"

[TrainedSniper X2AbilityTemplate]
LocFriendlyName="狙击训练"
LocHelpText="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"
LocLongDescription="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"
LocPromotionPopupText="获得小队视野能力，但只有当这个士兵的主武器为狙击步枪时才有效。"

;  ////////////
;  // Sapper //
;  ////////////

; - Class Template -

[LWOTC_APA_Sapper X2SoldierClassTemplate]
DisplayName = "工兵(APA)"
ClassSummary = "工兵提供远程爆炸支援，并擅长破坏敌人的阵型和防御工事。<br/><br/><font color='#CA7200'>可以使用突击步枪或霰弹枪，以及榴弹发射器或火箭发射器。</font>"
+AbilityTreeTitles = "掷弹兵"
+AbilityTreeTitles = "燧发枪手"
+AbilityTreeTitles = "支援"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames = "Unger"
+RandomNickNames = "Flash"
+RandomNickNames = "Power"
+RandomNickNames = "Thermal"
+RandomNickNames="Blaze"
+RandomNickNames="Bomber"
+RandomNickNames="Bulldog"
+RandomNickNames="Bull Rush"
+RandomNickNames="Claymore"
+RandomNickNames="Demo"
+RandomNickNames="Devil Dog"
+RandomNickNames="Diesel"
+RandomNickNames="Fireball"
+RandomNickNames="Hammer"
+RandomNickNames="Hellfire"
+RandomNickNames="Hightower"
+RandomNickNames="Hoss"
+RandomNickNames="Volcano"
+RandomNickNames="Hurricane"
+RandomNickNames="Junkyard"
+RandomNickNames="Juggernaut"
+RandomNickNames="Knockout"
+RandomNickNames="Kong"
+RandomNickNames="Mad Dog"
+RandomNickNames="Meltdown"
+RandomNickNames="Moose"
+RandomNickNames="Nova"
+RandomNickNames="Nitro"
+RandomNickNames="Overlord"
+RandomNickNames="Pitbull"
+RandomNickNames="Pyro"
+RandomNickNames="Redline"
+RandomNickNames="Rhino"
+RandomNickNames="Rocket"
+RandomNickNames="Seabreeze"
+RandomNickNames="Slab"
+RandomNickNames="Smash"
+RandomNickNames="Spitfire"
+RandomNickNames="Smokey"
+RandomNickNames="T-Bone"
+RandomNickNames="T-Rex"
+RandomNickNames="Tank"
+RandomNickNames="Thumper"
+RandomNickNames="Thunder"
+RandomNickNames="Tickle"
+RandomNickNames="Tiny"
+RandomNickNames="Titan"
+RandomNickNames="Dynamite"
+RandomNickNames="Torch"
+RandomNickNames="Wardog"
+RandomNickNames="Warhorse"
+RandomNicknames_Female = "Mama Bear"
+RandomNicknames_Female = "Freya"
+RandomNickNames_Male = "Papa Bear"
+RandomNickNames_Male = "Thor"
+RandomNickNames_Male = "Claymore"

PhotoboothSoloBLines_Female="Bringing the Boom!"
PhotoboothSoloBLines_Female="The forecast calles for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Female="No Cover. No Mercy."
PhotoboothSoloBLines_Female="Artillery. Danger Close."
PhotoboothSoloBLines_Female="Tick, tick, BOOM!"
PhotoboothSoloBLines_Female="Bombs away!"
PhotoboothSoloBLines_Female="Call her the weatherman, because she'll make it rain."
PhotoboothSoloBLines_Female="Stealth is overrated."

PhotoboothSoloBLines_Male="Bringing the Boom!"
PhotoboothSoloBLines_Male="The forecast calles for... COLLATERAL DAMAGE."
PhotoboothSoloBLines_Male="No Cover. No Mercy."
PhotoboothSoloBLines_Male="Artillery. Danger Close."
PhotoboothSoloBLines_Male="Tick, tick, BOOM!"
PhotoboothSoloBLines_Male="Bombs away!"
PhotoboothSoloBLines_Male="Call him the weatherman, because he'll make it rain."
PhotoboothSoloBLines_Male="Stealth is overrated."

; - Encyclopedia Entry -

[LWOTC_APA_Sapper X2EncyclopediaTemplate]
ListTitle = "工兵"
DescriptionTitle = "工兵"
DescriptionEntry = "工兵提供远程爆炸支援，并擅长破坏敌人的阵型和防御工事。<br/><br/><font color='#CA7200'>可以使用突击步枪或霰弹枪，以及榴弹发射器或火箭发射器。"

; - GTS Unlocks -

[LWOTC_APA_SapperUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "工兵(APA): 爆破理论 I"
Summary = "所有工兵的炸药库技能现在将从2级开始，无论军衔如何。"

[LWOTC_APA_SapperUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "工兵(APA): 爆破理论 II"
Summary = "所有工兵的炸药库技能现在将从3级开始，无论军衔如何。<br/><br/><font color='#CA7200'>需要 爆破理论 I</font>"

; - Item Templates -

[WOTC_APA_DefensiveMineItem X2GrenadeTemplate]
FriendlyName = "防御性地雷"
FriendlyNamePlural = "防御性地雷"
BriefSummary = "由防御性地雷能力赋予的可部署防御地雷 - 这实际上不应该作为一种可装备的物品出现..."
TacticalText = "由防御性地雷能力赋予的可部署防御地雷 - 这实际上不应该作为一种可装备的物品出现..."

; - Ability Templates -

[LWOTC_APA_ExplosiveOrdnance X2AbilityTemplate]
LocFriendlyName = "炸药库"
LocFlyOverText = "炸药库"
LocHelpText = "<Ability:ClassName/>的爆破能力会随着经验的增长而提高。"
LocLongDescription = "<Ability:ClassName/>的爆破能力会随着经验的增长而提高。"
LocPromotionPopupText = "<font color='#CA7200'>一级</font>（在 <Ability:RANKNAME1/> 等级 [1] 获得）<br/><Bullet/> 获得一个榴弹袋，允许 <Ability:ClassName/> 配备额外的手榴弹或火箭。<br/><Bullet/> 对环境造成伤害的手榴弹和火箭弹会造成额外 <font color='#3ABD23'>+6</font> 环境伤害。<br/><br/><font color='#CA7200'>二级</font>（在 <Ability:RANKNAME3/> 等级 [3] 获得）<br/><Bullet/> 榴弹获得额外 <font color='#3ABD23'>+<Ability:EXPLOSIVE_ORDNANCE_BONUS_GRENADE_POCKET_CHARGE_2/></font> 的使用次数（不包括特殊独特的手榴弹和火箭）。<br/><Bullet/> 对目标造成伤害的手榴弹和火箭弹有 <font color='#3ABD23'><Ability:EXPLOSIVE_ORDNANCE_EXPLOSIVE_CRIT_CHANCE/>%</font> 的暴击几率，造成额外 <font color='#3ABD23'>+<Ability:EXPLOSIVE_ORDNANCE_EXPLOSIVE_CRIT_DAMAGE/></font> 伤害。<br/><br/><font color='#CA7200'>三级</font>（在 <Ability:RANKNAME6/> 等级 [6] 获得）<br/><Bullet/> 榴弹获得额外 <font color='#3ABD23'>+<Ability:EXPLOSIVE_ORDNANCE_BONUS_GRENADE_POCKET_CHARGE_3/></font> 的使用次数（不包括独特的手榴弹和火箭）。<br/><Bullet/> '标准' 爆炸性手榴弹和火箭弹会对环境造成额外 <font color='#3ABD23'>+10</font> 伤害，基础伤害增加 <font color='#3ABD23'>+<Ability:EXPLOSIVE_ORDNANCE_STANDARD_EXPLOSIVE_BASE_DAMAGE/></font> ，暴击时伤害增加 <font color='#3ABD23'>+<Ability:EXPLOSIVE_ORDNANCE_STANDARD_EXPLOSIVE_CRIT_DAMAGE/></font>。<br/><br/>注意<br/><Bullet/> 防御地雷被视为 '标准' 爆炸物，并从所有爆破武器伤害奖励中受益。<br/><Bullet/> 如果没有毁灭自然能力，爆破武器的奖励不适用于重型武器。"

[LWOTC_APA_Skirmisher X2AbilityTemplate]
LocFriendlyName = "散兵"
LocFlyOverText = "散兵"
LocHelpText = "获得<font color='#3ABD23'>+<Ability:SKIRMISHER_MOBILITY_BONUS/></font>移动力和<font color='#3ABD23'>+15</font>闪避。"
LocLongDescription = "获得<font color='#3ABD23'>+<Ability:SKIRMISHER_MOBILITY_BONUS/></font>移动力和<font color='#3ABD23'>+15</font>闪避。"
LocPromotionPopupText = "获得<font color='#3ABD23'>+<Ability:SKIRMISHER_MOBILITY_BONUS/></font>移动力和<font color='#3ABD23'>+15</font>闪避。"

[WOTC_APA_Entrenched X2AbilityTemplate]
LocFriendlyName = "坚守"
LocFlyOverText = "坚守"
LocHelpText = "当在掩体后受到攻击时，受到的伤害会减少<font color='#CA7200'><Ability:ENTRENCHED_DAMAGE_REDUCTION/></font>（全掩体）和<font color='#CA7200'>-1</font>（半掩体）且无法遭到暴击。"
LocLongDescription = "当在掩体后受到攻击时，受到的伤害会减少<font color='#CA7200'><Ability:ENTRENCHED_DAMAGE_REDUCTION/></font>（全掩体）和<font color='#CA7200'>-1</font>（半掩体）且无法遭到暴击。"
LocPromotionPopupText = "当在掩体后受到攻击时，受到的伤害会减少<font color='#CA7200'><Ability:ENTRENCHED_DAMAGE_REDUCTION/></font>（全掩体）和<font color='#CA7200'>-1</font>（半掩体）且无法遭到暴击。"

[WOTC_APA_BurnOut X2AbilityTemplate]
LocFriendlyName = "化学战争"
LocFlyOverText = "化学战争"
LocHelpText = "装备的毒气手榴弹/火箭弹有可能使有机目标混乱或恐慌。"
LocLongDescription = "装备的毒气手榴弹/火箭弹有可能使有机目标混乱或恐慌。"
LocPromotionPopupText = "装备的毒气手榴弹/火箭弹有可能使有机目标混乱或恐慌。"

[LWOTC_APA_HeavyHitter X2AbilityTemplate]
LocFriendlyName = "重磅选手"
LocFlyOverText = "重磅选手"
LocHelpText = "所有伤害 <font color='#3ABD23'>+2</font> ."
LocLongDescription = "所有伤害 <font color='#3ABD23'>+2</font> ."
LocPromotionPopupText = "所有伤害 <font color='#3ABD23'>+2</font> ."

[LWOTC_APA_Rocketeer X2AbilityTemplate]
LocFriendlyName = "重型武器大师"
LocFlyOverText = "重型武器大师"
LocHelpText = "重型武器额外获得+1使用次数"
LocLongDescription = "重型武器额外获得+1使用次数"
LocPromotionPopupText = "重型武器额外获得+1使用次数"


;  /////////////////////
;  // Tech Specialist //
;  /////////////////////

; - Class Template -

[LWOTC_APA_Specialist X2SoldierClassTemplate]
DisplayName = "技术专家(APA)"
ClassSummary = "技术专家拥抱最先进的技术，使用一系列高科技工具来干扰他们的敌人并从远处支援他们的盟友。<br/><br/><font color='#CA7200'>可以使用狙击步枪和小精灵。</font>"
+AbilityTreeTitles = "毁灭者"
+AbilityTreeTitles = "技师"
+AbilityTreeTitles = "代理人"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

+RandomNickNames = "Sparks"
+RandomNickNames = "Jolt"
+RandomNickNames = "Volt"
+RandomNickNames = "Lightning"
+RandomNickNames = "Electron"
+RandomNickNames = "Grease"
+RandomNickNames = "Wrench"
+RandomNickNames = "Bolts"
+RandomNickNames = "Mainframe"
+RandomNickNames = "Flash"
+RandomNickNames = "Access"
+RandomNickNames = "Anaylist"
+RandomNickNames = "Binary"
+RandomNickNames = "Circuit"
+RandomNickNames = "Cyber"
+RandomNickNames = "Domain"
+RandomNickNames = "Giga"
+RandomNickNames = "Mega"
+RandomNickNames = "Micron"
+RandomNickNames = "Nano"
+RandomNickNames = "Raid"
+RandomNickNames = "Power"
+RandomNickNames = "Wireless"
+RandomNickNames = "Spook"
+RandomNickNames = "Shadow"
+RandomNickNames = "Tapper"
+RandomNickNames = "Monitor"
+RandomNickNames = "Thermal"
+RandomNicknames_Female = "Antikythera"
+RandomNicknames_Female = "Patchwork"
+RandomNickNames_Male = "Turing"

;+PhotoboothSoloBLines_Female = 
;+PhotoboothSoloBLines_Male = 

; - Encyclopedia Entry -

[LWOTC_APA_Specialist X2EncyclopediaTemplate]
ListTitle = "技术专家"
DescriptionTitle = "技术专家"
DescriptionEntry = "技术专家拥抱最先进的技术，使用一系列高科技工具来干扰他们的敌人并从远处支援他们的盟友。"

; - GTS Unlocks -

[LWOTC_APA_SpecialistUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "技术专家(APA): 自适应程序 I"
Summary = "所有技术专家士兵的协议包熟练度现在将从2级开始，无论军衔如何。"

[LWOTC_APA_SpecialistUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "技术专家(APA): 自适应程序 II"
Summary = "所有技术专家士兵的协议包熟练度现在将从3级开始，无论军衔如何。, regardless of rank.<br/><br/><font color='#CA7200'>需要 自适应程序 I</font>"

; - Ability Templates -

[WOTC_APA_AdaptiveAlloyPlating X2AbilityTemplate]
LocFriendlyName = "自适应合金镀层"
LocFlyOverText = "自适应合金镀层"
LocHelpText = "获得<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ARMOR/></font>点再生护甲和<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ABLATIVE/></font>点临时生命值。"
LocLongDescription = "获得<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ARMOR/></font>点再生护甲和<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ABLATIVE/></font>点临时生命值。"
LocPromotionPopupText = "获得<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ARMOR/></font>点再生护甲和<font color='#3ABD23'>+<Ability:ADAPTIVE_PLATING_ABLATIVE/></font>点临时生命值。<br/><br/><Bullet/> 再生护甲每回合只能恢复一点，且只有在所有其他来源的护甲被移除后才开始恢复。<br/><Bullet/> 再生护甲不会恢复来自其他来源（如护甲套装和背心）的削弱的护甲点数 - 它只能恢复自身，将 <Ability:ClassName/>的护甲从0提升到 <font color='#3ABD23'><Ability:ADAPTIVE_PLATING_ARMOR/></font>。<br/><Bullet/> 再生护甲在你的回合开始时恢复。这种护甲可以无限次地从0重新生成。<br/><Bullet/> 临时生命值失去后无法恢复。"

[LWOTC_APA_ElectronicWarfare X2AbilityTemplate]
LocFriendlyName = "电子战争"
LocFlyOverText = "电子战争"
LocHelpText = "获得<font color='#3ABD23'>+<Ability:ELECTRONIC_WARFARE_BONUS_HACKING/></font>入侵能力。被黑客攻击的机械敌人会受到伤害，并在黑客效果结束的回合失去行动力。"
LocLongDescription = "获得<font color='#3ABD23'>+<Ability:ELECTRONIC_WARFARE_BONUS_HACKING/></font>入侵能力。被黑客攻击的机械敌人会受到伤害，并在黑客效果结束的回合失去行动力。"
LocPromotionPopupText="<Bullet/> 受到干扰协议攻击的敌方单位会受到0-8点伤害，并在黑客效果结束时失去他们的行动力。<br/><Bullet/> 适用于被干扰协议晕眩或接管的单位。<br/><Bullet/> 根据入侵能力与目标的黑客防御来计算伤害。<br/>"

[WOTC_APA_Marauder X2AbilityTemplate]
LocFriendlyName = "掠夺者"
LocFlyOverText = "掠夺者"
LocHelpText = "标准射击不再结束回合，允许<Ability:ClassName/>在一个回合中射击两次或者先射击然后进行其他动作。同时也允许装备突击步枪类武器以增加火力。"
LocLongDescription = "标准射击不再结束回合，允许<Ability:ClassName/>在一个回合中射击两次或者先射击然后进行其他动作。同时也允许装备突击步枪类武器以增加火力。"
LocPromotionPopupText = "标准射击不再结束回合，允许<Ability:ClassName/>在一个回合中射击两次或者先射击然后进行其他动作。同时也允许装备突击步枪类武器以增加火力。"

[WOTC_APA_PsionicFeedback X2AbilityTemplate]
LocFriendlyName = "灵能反馈"
LocFlyOverText = "灵能反馈"
LocHelpText = "致盲协议现在有机会使目标陷入恐慌。对于灵能敌人，这个几率将增加。更先进的小精灵将进一步提高这个机会。"
LocLongDescription = "致盲协议现在有机会使目标陷入恐慌。对于灵能敌人，这个几率将增加。更先进的小精灵将进一步提高这个机会。""
LocPromotionPopupText = "致盲协议现在有机会使目标陷入恐慌。对于灵能敌人，这个几率将增加。更先进的小精灵将进一步提高这个机会。"

[LWOTC_APA_HeatAmmo X2AbilityTemplate]
LocFriendlyName = "HEAT弹药"
LocFlyOverText = "HEAT弹药"
LocHelpText = "对机械敌人造成的伤害提高 <font color='#3ABD23'>+50%</font> "
LocLongDescription = "对机械敌人造成的伤害提高 <font color='#3ABD23'>+50%</font> "
LocPromotionPopupText = "对机械敌人造成的伤害提高 <font color='#3ABD23'>+50%</font> "

[LWOTC_APA_StasisField X2AbilityTemplate]
LocFriendlyName="凝滞场"
LocLongDescription="将所有6格范围内的单位（包括你自己）置于静滞状态，持续1回合。处于静滞状态的单位不能行动且对伤害免疫。每次任务只能使用一次。"
LocHelpText="将所有6格范围内的单位（包括你自己）置于静滞状态，持续1回合。处于静滞状态的单位不能行动且对伤害免疫。每次任务只能使用一次。"
LocFlyOverText="凝滞场"
LocPromotionPopupText="<Bullet/> 将所有6格范围内的单位（包括你自己）置于静滞状态，持续1回合.<br/><Bullet/> 每次任务只能使用一次.<br/>"


;  /////////////////////
;  // Technician //
;  /////////////////////

; - Class Template -

[LWOTC_APA_Technician X2SoldierClassTemplate]
DisplayName = "技师"
ClassSummary = "技师接受过重型武器训练，如火箭发射器和火焰喷射器，在战斗中提供关键支持。<br/><br/><font color='#CA7200'>可以使用步枪、霰弹枪以及护腕。</font>"

+AbilityTreeTitles[0]="火箭兵"
+AbilityTreeTitles[1]=""
+AbilityTreeTitles[2]="枪手"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="手枪"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

RandomNickNames[0]="Angel"
RandomNickNames[1]="Beta"
RandomNickNames[2]="Bishop"
RandomNickNames[3]="Bones"
RandomNickNames[4]="Breaker"
RandomNickNames[5]="Broker"
RandomNickNames[6]="Crypto"
RandomNickNames[7]="Cyber"
RandomNickNames[8]="Cypher"
RandomNickNames[9]="Data"
RandomNickNames[10]="Deacon"
RandomNickNames[11]="Dr. Feelgood"
RandomNickNames[12]="Doc"
RandomNickNames[13]="Feedback"
RandomNickNames[14]="Firewall"
RandomNickNames[15]="Genius"
RandomNickNames[16]="Gizmo"
RandomNickNames[17]="Glitch"
RandomNickNames[18]="Hijack"
RandomNickNames[19]="Jammer"
RandomNickNames[20]="Jester"
RandomNickNames[21]="Jolt"
RandomNickNames[22]="Lightning"
RandomNickNames[23]="Mayday"
RandomNickNames[24]="Mega"
RandomNickNames[25]="Newton"
RandomNickNames[26]="Overdrive"
RandomNickNames[27]="Patch"
RandomNickNames[28]="Professor"
RandomNickNames[29]="Ragtime"
RandomNickNames[30]="Rascal"
RandomNickNames[31]="Rattler"
RandomNickNames[32]="Red"
RandomNickNames[33]="Rift"
RandomNickNames[34]="Ripcord"
RandomNickNames[35]="Rogue"
RandomNickNames[36]="Scorch"
RandomNickNames[37]="Sentinel"
RandomNickNames[38]="Shady"
RandomNickNames[39]="Shakes"
RandomNickNames[40]="Shifter"
RandomNickNames[41]="Shrink"
RandomNickNames[42]="Slider"
RandomNickNames[43]="Solar"
RandomNickNames[44]="Sonar"
RandomNickNames[45]="Sparks"
RandomNickNames[46]="Stitch"
RandomNickNames[47]="Tapper"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Tinker"
RandomNickNames[50]="Turbo"
RandomNickNames[51]="Venom"
RandomNickNames[52]="Vapor"
RandomNickNames[53]="Warbird"
RandomNickNames[54]="Warden"
RandomNickNames[55]="Whiskey"
RandomNickNames[56]="Wild Thing"
RandomNickNames[57]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[4]="Duchess"
;ALPHABETICAL ORDER

; - Ability Templates -
	Templates.AddItem(LWOTC_APA_ProfGauntlet());
[LWOTC_APA_ProfGauntlet X2AbilityTemplate]
LocFriendlyName = "怒火中烧"
LocHelpText = "技师对臂套的熟练度会随着经验的增长而提高。"
LocLongDescription = "技师对臂套的熟练度会随着经验的增长而提高。"
LocPromotionPopupText = "<font color='#CA7200'>一级</font>（在<Ability:RANKNAME1/>等级[1]获得）<br/><Bullet/> 获得使用重型武器能力 - 允许使用护臂，这是一个结合了火焰喷射器和迷你火箭发射器的装备。<br/><Bullet/> 使用护臂时提高瞄准能力，导致发射的火箭最大散布范围减少1格，并增加基础火焰喷射攻击的半径1格。 <br/><br/><br/><font color='#CA7200'>二级</font>（在<Ability:RANKNAME3/>等级[3]获得）<br/><Bullet/> 在发射火箭或使用火焰喷射器时提高对护臂的控制。您的火箭最大散布范围降低2格，而您的火焰喷射攻击则增加额外一格半径。<br/><br/><br/><font color='#CA7200'>三级</font>（在<Ability:RANKNAME6/>等级[6]获得）<br/><Bullet/> 获得“火与钢” - 用你的护臂进行攻击，并由护臂武器引起的火势，伤害+1。"

;Templates.AddItem(LWOTC_APA_RocketAccuracy1());
;Templates.AddItem(LWOTC_APA_RocketAccuracy2());
;Templates.AddItem(LWOTC_APA_FireAndSteel_Lvl1());
;Templates.AddItem(LWOTC_APA_FireAndSteel_Lvl2());

[LWOTC_APA_ReactiveAlloyPlating X2AbilityTemplate]
LocFriendlyName="反应合金镀层"
LocFlyOverText="反应合金镀层"
LocLongDescription="在受到伤害后，获得额外的护盾，直到回合结束。"
LocHelpText="在受到伤害后，获得额外的护盾，直到回合结束。"
LocPromotionPopupText="<Bullet/> 在受到冲击后，你的护甲会暂时变硬。在受到伤害后，直到下一回合结束，获得2点护盾。"

[LWOTC_APA_ReactiveAlloyPlatingPassive X2AbilityTemplate]
LocFriendlyName="反应合金镀层"
LocFlyOverText="反应合金镀层"
LocLongDescription="在受到伤害后，获得额外的护甲，直到回合结束。"
LocHelpText="在受到伤害后，获得额外的护甲，直到回合结束。"
LocPromotionPopupText="<Bullet/> 在受到冲击后，你的护甲会暂时变硬。在受到伤害后，直到下一回合结束，获得2点护甲。"

; Ability changes in Prof Class pack via OPTC patching

[WOTC_APA_EmergencyAid X2AbilityTemplate]
LocFriendlyName = "急救"
LocFlyOverText = "急救"
LocHelpText = "在激活此能力后，本轮使用的下一个医疗包治疗能力将不会消耗行动点。此外，你还将获得野战外科医生能力，有效地抵消高达1点伤害以进行任务后治疗。"
LocLongDescription = "在激活此能力后，本轮使用的下一个医疗包治疗能力将不会消耗行动点。此外，你还将获得野战外科医生能力，有效地抵消高达1点伤害以进行任务后治疗。"
LocPromotionPopupText = "在激活此能力后，本轮使用的下一个医疗包治疗能力将不会消耗行动点。此外，你还将获得野战外科医生能力，有效地抵消高达1点伤害以进行任务后治疗。"

[WOTC_APA_ElectronicSurveillance X2AbilityTemplate]
LocFriendlyName = "电子监控"
LocFlyOverText = "电子监控"
LocHelpText = "获得<font color='#3ABD23'>+<Ability:SURVEILLANCE_FREE_BATTLESCANNERS/></font>免费战斗扫描器和<font color='#3ABD23'>+<Ability:SURVEILLANCE_BONUS_BATTLESCANNERS/></font>额外战斗扫描器使用次数。此外，对所有被的战斗扫描器扫描到的敌人获得攻击加成：<font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_AIM_BONUS/>%</font>命中率和 <font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_CRIT_BONUS/>%</font>暴击率。"
LocLongDescription = "获得<font color='#3ABD23'>+<Ability:SURVEILLANCE_FREE_BATTLESCANNERS/></font>免费战斗扫描器和<font color='#3ABD23'>+<Ability:SURVEILLANCE_BONUS_BATTLESCANNERS/></font>额外战斗扫描器使用次数。此外，对所有被的战斗扫描器扫描到的敌人获得攻击加成：<font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_AIM_BONUS/>%</font>命中率和 <font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_CRIT_BONUS/>%</font>暴击率。"
LocPromotionPopupText = "获得<font color='#3ABD23'>+<Ability:SURVEILLANCE_FREE_BATTLESCANNERS/></font>免费战斗扫描器和<font color='#3ABD23'>+<Ability:SURVEILLANCE_BONUS_BATTLESCANNERS/></font>额外战斗扫描器使用次数。此外，对所有被的战斗扫描器扫描到的敌人获得攻击加成：<font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_AIM_BONUS/>%</font>命中率和 <font color='#3ABD23'>+<Ability:UPGRADED_SCANNERS_CRIT_BONUS/>%</font>暴击率。"

; Skirmisher
[Skirmisher X2SoldierClassTemplate]
DisplayName = "散兵"
ClassSummary = "散兵是高度机动的突击部队，他们在交火中积累优势，并从中受益。<br/><br/><font color='#CA7200'>可以使用冲锋枪和开颅器。</font>"
AbilityTreeTitles[0] = "执行者"
AbilityTreeTitles[1] = "史崔克"
AbilityTreeTitles[2] = "惩罚者"
AbilityTreeTitles[3] = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

[Reaper X2SoldierClassTemplate]
DisplayName = "死神"
ClassSummary = "死神擅长从阴影中发动攻击。<br/><br/><font color='#CA7200'>可以使用维克托步枪和手枪。</font>"
AbilityTreeTitles[0] = "特工"
AbilityTreeTitles[1] = "幽灵"
AbilityTreeTitles[2] = "掠夺者"
AbilityTreeTitles[3] = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

; Templar
[Templar X2SoldierClassTemplate]
DisplayName = "圣殿骑士"
ClassSummary = "圣殿骑士是一个神秘的组织的成员，他们能够从击败的敌人身上吸取能量，然后利用这种能力施展强大的灵能。<br/>"
AbilityTreeTitles[0] = "巫师"
AbilityTreeTitles[1] = "十字军"
AbilityTreeTitles[2] = "圣骑士"
AbilityTreeTitles[3] = "XCOM"

!RankIcons=()
+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"
+RankIcons[8]="UILibrary_WOTC_APA_Class_Pack.ranks_Brigadier_Level3"

[WOTC_APA_Volt X2AbilityTemplate]
LocFriendlyName = "雷击"
LocFlyOverText = "雷击"
LocHelpText = "<Ability:DYNAMIC_VOLT_DESCRIPTION/>"
LocLongDescription = "将能量聚焦成一道闪电，对机械敌人造成额外伤害（大约：<font color='#3ABD23'>+50%</font>）。"
LocPromotionPopupText = "将能量聚焦成一道闪电，对机械敌人造成额外伤害（大约：<font color='#3ABD23'>+50%</font>）。"

[WOTC_APA_Fuse X2AbilityTemplate]
LocFriendlyName = "导火线"
LocFlyOverText = "导火线"
LocHelpText = "<Ability:DYNAMIC_FUSE_DESCRIPTION/> <font color='#CA7200'><Ability:FUSE_COOLDOWN/></font>-回合冷却."
LocLongDescription = "远程引爆敌方装备的爆炸物. <font color='#CA7200'><Ability:FUSE_COOLDOWN/></font>-回合冷却."
LocPromotionPopupText = "远程引爆敌方装备的爆炸物. <font color='#CA7200'><Ability:FUSE_COOLDOWN/></font>-回合冷却."

; Ability Changes in LWOTC
[RescueProtocol X2AbilityTemplate]
LocFriendlyName="救援协议"
LocFlyoverText="救援协议"
LocLongDescription="使用你的小精灵授予一个盟友标准行动点，并为他们提供一些闪避和移动力的加成。"
LocHelpText="使用你的小精灵授予一个盟友标准行动点，并为他们提供一些闪避和移动力的加成。"
LocPromotionPopupText="<Bullet/> 救援协议赋予+<Ability:RESCUE_BONUS_DODGE/> 的闪避和 +<Ability:RESCUE_BONUS_MOBILITY/> 的移动能力。<br/><Bullet/> 救援协议只能用于没有行动点的盟友。<br/><Bullet/> 它不能用于隐藏、被压制或监视射击的单位。<br/><Bullet/> 盟友不能在同一回合中同时受益于指挥和救援协议。<br/><Bullet/> 不会结束你的回合。<br/><Bullet/> 每个任务，救援协议有 <Ability:RESCUE_CV_CHARGES/> 次使用次数。<br/><Bullet/> 随着无人机技术的提高，充能次数也会增加。"

[ConcussionRocket X2AbilityTemplate]
LocFriendlyName="震荡火箭"
LocFlyOverText="震荡火箭"
LocLongDescription="发射一种特殊的火箭，其造成的伤害有限，但有机会使其影响范围内的有机敌人眩晕或迷惑。"
LocHelpText="一种特殊的火箭，其造成的伤害有限，但有机会使其影响范围内的有机敌人眩晕或迷惑。 <Ability:ROCKETSCATTER/>"
LocPromotionPopupText="<Bullet/> 每次任务仅限一次.<br/><Bullet/> 眩晕几率 33%.<br/><Bullet/> 迷惑几率 50% <br/><Bullet/> 需要1行动点并将结束回合.<br/><Bullet/> 对原典和灵能僵尸无效.<br/><Bullet/> 不会作用于队友.<br/>"
